In [1]:
import pandas as pd

In [2]:
df1 = pd. DataFrame({
 'ID': [1, 2, 3],
 'Nome': ['Alice', 'Bob', 'Charlie']
})

df2 = pd. DataFrame({
 'ID': [3, 4, 5],
 'Idade': [23, 34, 45]
})

In [3]:
df1

   ID     Nome
0   1    Alice
1   2      Bob
2   3  Charlie

In [6]:
df2

   ID  Idade
0   3     23
1   4     34
2   5     45

In [4]:
# Traz tudo de ambos os lados 
full_outer = pd.merge(df1, df2, on='ID', how='outer')
print(full_outer)

   ID     Nome  Idade
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   23.0
3   4      NaN   34.0
4   5      NaN   45.0

In [5]:
# Traz somente a intersecção, assim como no sql
inner = pd.merge(df1, df2, on='ID', how='inner')
print(inner)

   ID     Nome  Idade
0   3  Charlie     23

In [7]:
# Congela o primeiro dataframe e retorna as correspondencias.
left_outer = pd.merge(df1, df2, on='ID', how='left')
print(left_outer)

   ID     Nome  Idade
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie   23.0

In [ ]:
right_outer = pd.merge(df1, df2, on='ID', how='right')
print(right_outer)